Examinator/src/InformationRegisters/ПроведениеПодчиненныхМероприятийСУО/ПроведениеПодчиненныхМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведениеПодчиненныхМероприятийСУО</name>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.АудиторииСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаПроведения</name>
    <type>
      <types>CatalogRef.СхемыМероприятийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОценкиКачестваОбученияСУО/ОценкиКачестваОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиКачестваОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выставлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыставления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/УправлениеОбучениемСУОПовтИсп/Module.bsl
// ДАННЫЕ МЕРОПРИЯТИЙ

Функция ВыборкаДанныхДляЗаполненияБиблиотекиПользователя(Мероприятие, ПроведениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроведениеОбученияСУОКниги.Книга КАК Ресурс,
	               |	ПроведениеОбученияСУОКниги.Фрагмент КАК Фрагмент,
	               |	ПроведениеОбученияСУОКниги.Примечание КАК Примечание,
	               |	ПроведениеОбученияСУОКниги.ПоказатьПослеПрохождения КАК ПоказатьПослеПрохождения,
	               |	ПроведениеОбученияСУОКниги.СкрыватьОтУченика КАК СкрыватьОтУченика,
	               |	ПроведениеОбученияСУОКниги.ДобавитьВБиблиотеку КАК ДобавитьВБиблиотеку,
	               |	ПроведениеОбученияСУОКниги.МеткаВБиблиотеке КАК МеткаВБиблиотеке,
	               |	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеЗапланировано КАК ПоказатьПриСтатусеЗапланировано,
	               |	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеАктивно КАК ПоказатьПриСтатусеАктивно,
	               |	ПроведениеОбученияСУОКниги.ПоказатьПриСтатусеЗавершено КАК ПоказатьПриСтатусеЗавершено,
	               |	ПроведениеОбученияСУОКниги.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	Документ.ПроведениеОбученияСУО.Книги КАК ПроведениеОбученияСУОКниги
	               |ГДЕ
	               |	ПроведениеОбученияСУОКниги.Ссылка = &ПроведениеОбучения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ЭлектронныйРесурс,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.Фрагмент,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.Примечание,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПослеПрохождения,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.СкрыватьОтУченика,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ДобавитьВБиблиотеку,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.МеткаВБиблиотеке,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗапланировано,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеАктивно,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗавершено,
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.ДатаИзменения
	               |ИЗ
	               |	Документ.ПроведениеОбученияСУО.ЭлектронныеРесурсы КАК ПроведениеОбученияСУОЭлектронныеРесурсы
	               |ГДЕ
	               |	ПроведениеОбученияСУОЭлектронныеРесурсы.Ссылка = &ПроведениеОбучения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПроведениеОбученияСУОФайлы.Файл,
	               |	NULL,
	               |	ПроведениеОбученияСУОФайлы.Примечание,
	               |	ПроведениеОбученияСУОФайлы.ПоказатьПослеПрохождения,
	               |	ПроведениеОбученияСУОФайлы.СкрыватьОтУченика,
	               |	ПроведениеОбученияСУОФайлы.ДобавитьВБиблиотеку,
	               |	ПроведениеОбученияСУОФайлы.МеткаВБиблиотеке,
	               |	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеЗапланировано,
	               |	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеАктивно,
	               |	ПроведениеОбученияСУОФайлы.ПоказатьПриСтатусеЗавершено,
	               |	ПроведениеОбученияСУОФайлы.ДатаИзменения
	               |ИЗ
	               |	Документ.ПроведениеОбученияСУО.Файлы КАК ПроведениеОбученияСУОФайлы
	               |ГДЕ
	               |	ПроведениеОбученияСУОФайлы.Ссылка = &ПроведениеОбучения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КаталогМероприятийСУОКниги.Книга,
	               |	КаталогМероприятийСУОКниги.Фрагмент,
	               |	КаталогМероприятийСУОКниги.Примечание,
	               |	КаталогМероприятийСУОКниги.ПоказатьПослеПрохождения,
	               |	КаталогМероприятийСУОКниги.СкрыватьОтУченика,
	               |	КаталогМероприятийСУОКниги.ДобавитьВБиблиотеку,
	               |	КаталогМероприятийСУОКниги.МеткаВБиблиотеке,
	               |	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеЗапланировано,
	               |	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеАктивно,
	               |	КаталогМероприятийСУОКниги.ПоказатьПриСтатусеЗавершено,
	               |	NULL
	               |ИЗ
	               |	Справочник.КаталогМероприятийСУО.Книги КАК КаталогМероприятийСУОКниги
	               |ГДЕ
	               |	КаталогМероприятийСУОКниги.Ссылка = &Мероприятие
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ЭлектронныйРесурс,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.Фрагмент,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.Примечание,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПослеПрохождения,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.СкрыватьОтУченика,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ДобавитьВБиблиотеку,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.МеткаВБиблиотеке,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗапланировано,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеАктивно,
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.ПоказатьПриСтатусеЗавершено,
	               |	NULL
	               |ИЗ
	               |	Справочник.КаталогМероприятийСУО.ЭлектронныеРесурсы КАК КаталогМероприятийСУОЭлектронныеРесурсы
	               |ГДЕ
	               |	КаталогМероприятийСУОЭлектронныеРесурсы.Ссылка = &Мероприятие
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КаталогМероприятийСУОФайлы.Файл,
	               |	NULL,
	               |	КаталогМероприятийСУОФайлы.Примечание,
	               |	КаталогМероприятийСУОФайлы.ПоказатьПослеПрохождения,
	               |	КаталогМероприятийСУОФайлы.СкрыватьОтУченика,
	               |	КаталогМероприятийСУОФайлы.ДобавитьВБиблиотеку,
	               |	КаталогМероприятийСУОФайлы.МеткаВБиблиотеке,
	               |	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеЗапланировано,
	               |	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеАктивно,
	               |	КаталогМероприятийСУОФайлы.ПоказатьПриСтатусеЗавершено,
	               |	NULL
	               |ИЗ
	               |	Справочник.КаталогМероприятийСУО.Файлы КАК КаталогМероприятийСУОФайлы
	               |ГДЕ
	               |	КаталогМероприятийСУОФайлы.Ссылка = &Мероприятие";

	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Функция ДанныеМероприятия(Мероприятие, Реквизиты) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, Реквизиты);	
	
КонецФункции

Функция ОписаниеЕдинственногоЗаданияСценария(Знач Сценарий = Неопределено, Знач ПроведениеОбучения) Экспорт
	
	Если Сценарий = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Документы.ПроведениеОбученияСУО.СценарийОбучения(ПроведениеОбучения);
	КонецЕсли;
	
	ОписаниеЗадания = Новый Структура(
		"Задание,
		|НаОсновеЭлектронногоРесурса,
		|ЭлектронныйРесурс,
		|Фрагмент,
		|Наименование,
		|НаОсновеЭлектронногоКурса,
		|ЭлектронныйКурс,
		|ДатаНачалаДоступаКЗаданию,
		|ДатаОкончанияДоступаКЗаданию,
		|СкрытьВремяДоступаКЗаданию,
		|ВыставляетсяОценка");
	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения, Сценарий);
	
	Если ТипЗнч(Сценарий) = Тип("ДокументСсылка.ПроведениеОбученияСУО") // Без сценария
		И ЗначениеЗаполнено(Сценарий) Тогда
		
		Если ВидОбучения.Электронное Тогда
			
			Сценарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "ЭлектронныйРесурс");
			
			Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
				
				Сценарий = Неопределено;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПроведениеОбученияСУОЭлектронныеЗадания.Задание КАК Задание,
					|	ПроведениеОбученияСУОЭлектронныеЗадания.Наименование КАК Наименование,
					|	ПроведениеОбученияСУОЭлектронныеЗадания.ДатаНачалаДоступаКЗаданию КАК ДатаНачалаДоступаКЗаданию,
					|	ПроведениеОбученияСУОЭлектронныеЗадания.ДатаОкончанияДоступаКЗаданию КАК ДатаОкончанияДоступаКЗаданию,
					|	ПроведениеОбученияСУОЭлектронныеЗадания.СкрытьВремяДоступаКЗаданию КАК СкрытьВремяДоступаКЗаданию
					|ИЗ
					|	Документ.ПроведениеОбученияСУО.ЭлектронныеЗадания КАК ПроведениеОбученияСУОЭлектронныеЗадания
					|ГДЕ
					|	ПроведениеОбученияСУОЭлектронныеЗадания.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ПроведениеОбучения);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда				
						
						ВыборкаДетальныеЗаписи.Следующий();
						
						НаОсновеЭлектронногоРесурса = ?(ТипЗнч(ВыборкаДетальныеЗаписи.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ"), Истина, Ложь);
						НаОсновеЭлектронногоКурса = ?(ТипЗнч(ВыборкаДетальныеЗаписи.Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы"), Истина, Ложь);
						
						ОписаниеЗадания.Вставить("Задание", ВыборкаДетальныеЗаписи.Задание);
						ОписаниеЗадания.Вставить("НаОсновеЭлектронногоРесурса", НаОсновеЭлектронногоРесурса);						
						ОписаниеЗадания.Вставить("ЭлектронныйРесурс", ?(НаОсновеЭлектронногоРесурса, ВыборкаДетальныеЗаписи.Задание, Неопределено)); 
						ОписаниеЗадания.Вставить("НаОсновеЭлектронногоКурса", НаОсновеЭлектронногоКурса);
						ОписаниеЗадания.Вставить("ЭлектронныйКурс", ?(НаОсновеЭлектронногоКурса, ВыборкаДетальныеЗаписи.Задание, Неопределено)); 
						ОписаниеЗадания.Вставить("Фрагмент", Неопределено);
						ОписаниеЗадания.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
						ОписаниеЗадания.Вставить("ДатаНачалаДоступаКЗаданию", ВыборкаДетальныеЗаписи.ДатаНачалаДоступаКЗаданию);
						ОписаниеЗадания.Вставить("ДатаОкончанияДоступаКЗаданию", ВыборкаДетальныеЗаписи.ДатаОкончанияДоступаКЗаданию);
						ОписаниеЗадания.Вставить("СкрытьВремяДоступаКЗаданию", ВыборкаДетальныеЗаписи.СкрытьВремяДоступаКЗаданию);

						Если ВидОбучения.ВыставляетсяОценка И НаОсновеЭлектронногоРесурса Тогда
							ОписаниеЗадания.Вставить("ВыставляетсяОценка", Справочники.СводыЗнанийСУЗ.ВыставляетсяОценка(ВыборкаДетальныеЗаписи.Задание)); 
						Иначе							
							ОписаниеЗадания.Вставить("ВыставляетсяОценка", ВидОбучения.ВыставляетсяОценка);
						КонецЕсли;
						
						Возврат ОписаниеЗадания;
						
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И ЗначениеЗаполнено(Сценарий) Тогда
		
		ЭлектронныйРесурс = Сценарий;
		
		ОписаниеЗадания.Вставить("Задание", ЭлектронныйРесурс);
		ОписаниеЗадания.Вставить("НаОсновеЭлектронногоРесурса", Истина);
		ОписаниеЗадания.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);
		ОписаниеЗадания.Вставить("Фрагмент", Неопределено);
		ОписаниеЗадания.Вставить("Наименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование"));
		ОписаниеЗадания.Вставить("НаОсновеЭлектронногоКурса", Ложь);
		ОписаниеЗадания.Вставить("ЭлектронныйКурс", Неопределено);
		ОписаниеЗадания.Вставить("ДатаНачалаДоступаКЗаданию", Дата("00010101"));
		ОписаниеЗадания.Вставить("ДатаОкончанияДоступаКЗаданию", Дата("00010101"));
		ОписаниеЗадания.Вставить("СкрытьВремяДоступаКЗаданию", Ложь);
		
		Если ВидОбучения.ВыставляетсяОценка Тогда
			ОписаниеЗадания.Вставить("ВыставляетсяОценка", Справочники.СводыЗнанийСУЗ.ВыставляетсяОценка(ЭлектронныйРесурс)); 
		Иначе							
			ОписаниеЗадания.Вставить("ВыставляетсяОценка", ВидОбучения.ВыставляетсяОценка);
		КонецЕсли;		
		
		Возврат ОписаниеЗадания;
		
	КонецЕсли;
	
	Если ТипЗнч(Сценарий) = Тип("СправочникСсылка.КаталогМероприятийСУО")
		И ЗначениеЗаполнено(Сценарий) Тогда
		
		Мероприятие = Сценарий;
		
		ВидМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Мероприятие, "Вид");
		
		Если НЕ ВидМероприятия.Электронное Тогда
			Возврат Неопределено;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаданияСУО.Ссылка КАК Задание,
			|	ЗаданияСУО.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
			|	ЗаданияСУО.Фрагмент КАК Фрагмент,
			|	ЗаданияСУО.НаОсновеЭлектронногоРесурса КАК НаОсновеЭлектронногоРесурса,
			|	ЗаданияСУО.Наименование КАК Наименование,
			|	ЗаданияСУО.ПреподавательВыставляетОценку КАК ПреподавательВыставляетОценку
			|ИЗ
			|	Справочник.ЗаданияСУО КАК ЗаданияСУО
			|ГДЕ
			|	ЗаданияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ЗаданияСУО.Владелец = &Мероприятие";

		Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
			
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			ОписаниеЗадания.Вставить("Задание", ВыборкаДетальныеЗаписи.Задание);
			ОписаниеЗадания.Вставить("НаОсновеЭлектронногоРесурса", ВыборкаДетальныеЗаписи.НаОсновеЭлектронногоРесурса);
			ОписаниеЗадания.Вставить("ЭлектронныйРесурс", ВыборкаДетальныеЗаписи.ЭлектронныйРесурс); 
			ОписаниеЗадания.Вставить("Фрагмент", ВыборкаДетальныеЗаписи.Фрагмент);
			ОписаниеЗадания.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
			ОписаниеЗадания.Вставить("НаОсновеЭлектронногоКурса", Ложь);
			ОписаниеЗадания.Вставить("ЭлектронныйКурс", Неопределено);
			ОписаниеЗадания.Вставить("ДатаНачалаДоступаКЗаданию", Дата("00010101"));
			ОписаниеЗадания.Вставить("ДатаОкончанияДоступаКЗаданию", Дата("00010101"));
			ОписаниеЗадания.Вставить("СкрытьВремяДоступаКЗаданию", Ложь);
			ОписаниеЗадания.Вставить("ВыставляетсяОценка", ВидМероприятия.ВыставляетсяОценка);
					
			Возврат ОписаниеЗадания;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗапрещеноПовторноеПрохождениеМероприятия(Мероприятие) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Мероприятие, "ЗапретитьПовторноеПрохождение");
КонецФункции

// СТАТУСЫ МЕРОПРИЯТИЙ

Функция ПроведениеПреподавателемОбученияОтменено(ПроведениеПреподавателемОбучения) Экспорт
	
	ПроведениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПреподавателемОбучения, "ПроведениеОбучения");
	
	СтатусПроведенияМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеОбучения, "Статус");
	
	Если СтатусПроведенияМероприятия = Перечисления.СтатусыПроведенияОбъектовСУО.Отменено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СтатусПроцессаОбучения(Знач ПрохождениеОбучения) Экспорт
	// Функция используется только в отчетах
	Возврат Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ПрохождениеОбучения);
КонецФункции

// ДАТЫ ОБУЧЕНИЯ

// Функция возвращает дату начала проведения обучения.
//
Функция ДатаНачалаПроведенияОбучения(ПроведениеОбучения, Мероприятие = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	
	ДанныеПроведенияМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "НаОсновеМероприятия, Мероприятие, СхемаПроведения, ДатаНачалаПроведения, ДатаНачалаДоступа");
	
	Если ДанныеПроведенияМероприятия.НаОсновеМероприятия Тогда
	
		Если Мероприятие = Неопределено ИЛИ ТипЗнч(Мероприятие) <> Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
			Мероприятие = ДанныеПроведенияМероприятия.Мероприятие;
		КонецЕсли;
		
		Если ДанныеПроведенияМероприятия.Мероприятие = Мероприятие Тогда // Общее или простое (без подчиненных)
			
			ДанныеМероприятия = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(Мероприятие, "Вид");
			
			Если ДанныеМероприятия.Вид.Общее Тогда // Общее
				
				// Выбираем самое раннее подчиненное мероприятие

				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения КАК ДатаПроведения
					|ИЗ
					|	РегистрСведений.ПроведениеПодчиненныхМероприятийСУО КАК ПроведениеПодчиненныхМероприятийСУО
					|ГДЕ
					|	ПроведениеПодчиненныхМероприятийСУО.ПроведениеОбучения = &ПроведениеОбучения
					|	И ПроведениеПодчиненныхМероприятийСУО.СхемаПроведения = &СхемаПроведения
					|	И ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения <> ДАТАВРЕМЯ(1, 1, 1)
					|
					|УПОРЯДОЧИТЬ ПО
					|	ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения";

				Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
				Запрос.УстановитьПараметр("СхемаПроведения", ДанныеПроведенияМероприятия.СхемаПроведения);

				Результат = Запрос.Выполнить();

				Если Результат.Пустой() Тогда
					Возврат Дата("00010101");
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();

				ВыборкаДетальныеЗаписи.Следующий();
				
				Возврат ВыборкаДетальныеЗаписи.ДатаПроведения;
				
			Иначе // Простое
				
				Возврат ДанныеПроведенияМероприятия.ДатаНачалаПроведения;
				
			КонецЕсли;
			
		Иначе // Подчиненное
			
			// Находим данные о проведении подчиненного мероприятия
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения КАК ДатаПроведения 
				|ИЗ
				|	РегистрСведений.ПроведениеПодчиненныхМероприятийСУО КАК ПроведениеПодчиненныхМероприятийСУО
				|ГДЕ
				|	ПроведениеПодчиненныхМероприятийСУО.ПроведениеОбучения = &ПроведениеОбучения
				|	И ПроведениеПодчиненныхМероприятийСУО.Мероприятие = &Мероприятие
				|	И ПроведениеПодчиненныхМероприятийСУО.СхемаПроведения = &СхемаПроведения";

			Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
			Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
			Запрос.УстановитьПараметр("СхемаПроведения", ДанныеПроведенияМероприятия.СхемаПроведения);

			Результат = Запрос.Выполнить();

			Если Результат.Пустой() Тогда
				Возврат  Дата("00010101");
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			Возврат ВыборкаДетальныеЗаписи.ДатаПроведения;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДанныеПроведенияМероприятия.ДатаНачалаДоступа) Тогда
			Возврат ДанныеПроведенияМероприятия.ДатаНачалаДоступа;
		Иначе			
			Возврат ДанныеПроведенияМероприятия.ДатаНачалаПроведения;
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

// Функция возвращает дату окончания проведения мероприятия,
// при этом мероприятие может быть подчиненным.
//
Функция ДатаОкончанияПроведенияОбучения(ПроведениеОбучения, Мероприятие = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПроведенияМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеОбучения, "НаОсновеМероприятия, Мероприятие, СхемаПроведения, ДатаОкончанияПроведения, ДатаКонтроля, ДатаНачалаПроведения");
	
	Если ДанныеПроведенияМероприятия.НаОсновеМероприятия Тогда
	
		Если Мероприятие = Неопределено ИЛИ ТипЗнч(Мероприятие) <> Тип("СправочникСсылка.КаталогМероприятийСУО") Тогда
			Мероприятие = ДанныеПроведенияМероприятия.Мероприятие;
		КонецЕсли;
		
		ДанныеМероприятия = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(Мероприятие, "Вид, ПродолжительностьВСекундах");
		
		Если ДанныеПроведенияМероприятия.Мероприятие = Мероприятие 
			И ДанныеМероприятия.Вид.Общее Тогда
			
			// Выбираем самое позднее подчиненное мероприятие

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПроведениеПодчиненныхМероприятийСУО.Мероприятие КАК ПодчиненноеМероприятие
				|ИЗ
				|	РегистрСведений.ПроведениеПодчиненныхМероприятийСУО КАК ПроведениеПодчиненныхМероприятийСУО
				|ГДЕ
				|	ПроведениеПодчиненныхМероприятийСУО.ПроведениеОбучения = &ПроведениеОбучения
				|	И ПроведениеПодчиненныхМероприятийСУО.СхемаПроведения = &СхемаПроведения
				|	И ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения <> ДАТАВРЕМЯ(1, 1, 1)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПроведениеПодчиненныхМероприятийСУО.ДатаПроведения УБЫВ";

			Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
			Запрос.УстановитьПараметр("СхемаПроведения", ДанныеПроведенияМероприятия.СхемаПроведения);

			Результат = Запрос.Выполнить();

			Если Результат.Пустой() Тогда
				Возврат ДанныеПроведенияМероприятия.ДатаНачалаПроведения;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			ВыборкаДетальныеЗаписи.Следующий();
			
			Возврат Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, ВыборкаДетальныеЗаписи.ПодчиненноеМероприятие);
				
		Иначе // Подчиненное общему мероприятие или простое (не общее)
			
			ДатаНачалаПроведенияМероприятия = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Мероприятие);
			
			Если ЗначениеЗаполнено(ДатаНачалаПроведенияМероприятия) Тогда
				ПродолжительностьМероприятияВСекундах = ДанныеМероприятия.ПродолжительностьВСекундах; 
			Иначе
				ПродолжительностьМероприятияВСекундах = 0;
			КонецЕсли;
			
			Возврат ДатаНачалаПроведенияМероприятия + ПродолжительностьМероприятияВСекундах;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДанныеПроведенияМероприятия.ДатаКонтроля) Тогда
			Возврат ДанныеПроведенияМероприятия.ДатаКонтроля;
		Иначе
			Возврат ДанныеПроведенияМероприятия.ДатаОкончанияПроведения;
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

// ОЦЕНКИ

Функция ПолучитьШкалуОценокПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ШкалаОценкиПоУмолчанию = Константы.ШкалаОценокПоУмолчаниюСУО.Получить();
	
	Если ЗначениеЗаполнено(ШкалаОценкиПоУмолчанию) Тогда
		Возврат ШкалаОценкиПоУмолчанию;
	Иначе
		Возврат Справочники.ШкалыОценокСУО.Стобалльная;
	КонецЕсли;
	
КонецФункции

// Конвертирует баллы в значение заданной шкалы.
//
Функция ОценкаИзБаллов(Баллы, Шкала = Неопределено) Экспорт
	Возврат Справочники.ШкалыОценокСУО.ОценкаИзБаллов(Баллы, Шкала);
КонецФункции

// Возвращает количество баллов для оценки.
// По умолчанию возвращает максимально возможное количество
// баллов, но при задании Минимум = Истина, может возвращать
// минимально возможное количество баллов.
//
Функция ПолучитьБаллыИзОценки(Оценка) Экспорт
	Возврат Справочники.ШкалыОценокСУО.БаллыИзОценки(Оценка);
КонецФункции

// КАЧЕСТВО ОБУЧЕНИЯ

Функция ОценкаКачестваПроведенияОбучения(Знач ПроведениеОбучения) Экспорт
	Возврат РегистрыСведений.ОценкиКачестваОбученияСУО.ОценкаЗаПроведениеОбучения(ПроведениеОбучения);	
КонецФункции

// РАЗНОЕ

// Возвращает руководителя предприятия
//
Функция ПолучитьРуководителяПредприятия() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.РуководительПредприятия.Получить();
	
КонецФункции
